# Preparing the environment

## Graphics and plotting

The following block of code initializes the Python plotting library [matplotlib](http://matplotlib.org/gallery.html) and configures it to show figures embedded in the notebook (as opposed to opening a new window for each figure):

In [9]:
%matplotlib inline

import matplotlib
import matplotlib.pyplot as plt

The Seaborn library provides easy-to-use plotting functions for common plot types, and better default visual styles.

In [2]:
import seaborn as sea

Set the default size and style of the plot.  (Plots are styled to [look like R's `ggplot`](http://tonysyu.github.io/mpltools/auto_examples/style/plot_ggplot.html) library.)

In [3]:
matplotlib.rcParams['figure.figsize'] = (10, 7)

sea.set_style('dark')

Also make the NumPy library available (without it, some features of Matplotlib and -especially- Seaborn) will *not* work:

In [4]:
import numpy as np

## SQL database connection

The ESC403 cluster comes preinstalled with [Catherine Devlin's `%sql`-magic for IPython][1]; this allows you to run SQL queries from the IPython notebook, and intermix them with Python code.

[1]: https://github.com/catherinedevlin/ipython-sql

Before we can use the `%sql` syntax, two steps must be taken:

* Load the IPython-SQL bridge code

In [10]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

* Connect to an actual database; this must be the first `%sql` statement (the `rmurri@/equidistantpoints` syntax means "connect to the PostGreSQL DB named `equidistantpoints` running on *this* host as user `rmurri`" -- of course change `rmurri` to *your* user name):

In [11]:
%sql postgresql://rmurri@/equidistantpoints

u'Connected: rmurri@equidistantpoints'

This database contains the [Equidistant Geographic Grid Points and Modern Climate](http://mypage.iu.edu/~pdpolly/Data.html) dataset (this the "extended North American data" in the words of the source website), imported into the PostGreSQL server running on this machine with a modified version of the [`mysql-postgresql-converter` script](https://github.com/lanyrd/mysql-postgresql-converter).

The [original publication](http://mypage.iu.edu/~pdpolly/Data.html) describes the dataset thusly:

> Database of equidistant grid points covering the globe at 25 km, 50 km, and 100 km intervals. A separate table of points just for the continent of North America is provided, with an ID that links each point into the global 50 km grid.
> 
> A detailed set of North American 50 km points is available with the following data linked to the 50 km grid by the point's ID number:
> 
> * Elevation from "TerrainBase Global Land Elevation and Ocean Depth" from the National Geophysical Data Center and World Data Centers-A for Solid Earth Geophysics and for Marine Geology and Geophysics (NGDC/WDC-A)
> * Precipitation and Temperature from "Global Air Temperature and Precipitation: Regridded Monthly and Annual Climatologies" from Wilmott, Matsuura and Legates, Center for Climatic Research, University of Delaware.
> * Macrovegetation cover from Matthews, 1984. "Prescription of Land-surface Boundary Conditions in GISS GCM II: A Simple Method Based on High-resolution Vegetation Data Sets". NASA TM-86096.
> * Ecoregions from R.G. Bailey, "Ecoregions of North America", Rocky Mountain Research Station, US Forest Service, Fort Collins, Colorado.
> * Bioclimatic variables on temperature, seasonality, precipitation, etc. from the WorldClim Global Climate Data set compiled by Hijmans et al., 2005.
>
> The gridpoints themselves and the data compilation may be cited as "Polly, P.D.  2010. Tiptoeing through the trophics: geographic variation in carnivoran locomotor ecomorphology in relation to environment.  Pp. 374-410 in A. Goswami and A. Friscia (eds.), Carnivoran Evolution: New Views on Phylogeny, Form, and Function."

Let us then explore the tables to get a "feeling" of the data here (**Note:** this query is non-standard and will only run on the PostgreSQL RDBMS):

In [8]:
%sql select table_name from information_schema.tables where table_schema = 'public';

8 rows affected.

[(u'naecoregionsbailey',),
 (u'natempwilmott',),
 (u'navegcovermatthews',),
 (u'na50kmpoints',),
 (u'naaltterrainbase',),
 (u'nabioclimvars',),
 (u'naprecipwilmott',),
 (u'northamerica50kmpoints',)]

In [8]:
%sql select * from na50kmpoints limit 3;

3 rows affected.

[(1, 103148, Decimal('-42.17270'), Decimal('83.26264'), Decimal('0.11278'), Decimal('0.94127')),
 (2, 103149, Decimal('-38.34420'), Decimal('83.26264'), Decimal('0.11749'), Decimal('0.94691')),
 (3, 103150, Decimal('-34.51560'), Decimal('83.26264'), Decimal('0.12169'), Decimal('0.95277'))]

In [6]:
%sql select * from naaltterrainbase limit 3;

3 rows affected.

[(6, None, Decimal('-79.46900'), Decimal('82.81348'), Decimal('460.00000')),
 (7, None, Decimal('-75.87860'), Decimal('82.81348'), Decimal('980.00000')),
 (8, None, Decimal('-72.28820'), Decimal('82.81348'), Decimal('520.00000'))]

In [7]:
%sql select * from nabioclimvars limit 3;

3 rows affected.

[(1, 103148, Decimal('-17.32920'), Decimal('6.45830'), Decimal('16.43340'), Decimal('1239.56640'), Decimal('3.80000'), Decimal('-35.50000'), Decimal('39.30000'), Decimal('-2.93330'), Decimal('-30.66670'), Decimal('-0.60000'), Decimal('-30.66670'), Decimal('150.00000'), Decimal('23.00000'), Decimal('7.00000'), Decimal('45.06160'), Decimal('62.00000'), Decimal('24.00000'), Decimal('52.00000'), Decimal('24.00000')),
 (2, 103149, Decimal('-16.92080'), Decimal('6.75830'), Decimal('17.24060'), Decimal('1230.63450'), Decimal('4.10000'), Decimal('-35.10000'), Decimal('39.20000'), Decimal('-2.61670'), Decimal('-28.98330'), Decimal('-0.35000'), Decimal('-30.13330'), Decimal('140.00000'), Decimal('22.00000'), Decimal('7.00000'), Decimal('45.84400'), Decimal('58.00000'), Decimal('22.00000'), Decimal('49.00000'), Decimal('23.00000')),
 (3, 103150, Decimal('-17.19170'), Decimal('6.90000'), Decimal('17.64710'), Decimal('1234.91780'), Decimal('3.80000'), Decimal('-35.30000'), Decimal('39.10000'), Decimal('-2.81670'), Decimal('-21.51670'), Decimal('-0.53330'), Decimal('-30.36670'), Decimal('141.00000'), Decimal('22.00000'), Decimal('6.00000'), Decimal('43.26290'), Decimal('57.00000'), Decimal('23.00000'), Decimal('49.00000'), Decimal('24.00000'))]

In [8]:
%sql select * from navegcovermatthews limit 3;

3 rows affected.

[(6, Decimal('-79.46900'), Decimal('82.81300'), 31, u'ice'),
 (7, Decimal('-75.87900'), Decimal('82.81300'), 31, u'ice'),
 (8, Decimal('-72.28800'), Decimal('82.81300'), 31, u'ice')]

In [10]:
%sql select * from naprecipwilmott limit 3;

3 rows affected.

[(6, Decimal('-79.46900'), Decimal('82.81348'), Decimal('6.80000'), Decimal('4.40000'), Decimal('6.90000'), Decimal('5.00000'), Decimal('8.10000'), Decimal('7.70000'), Decimal('16.20000'), Decimal('20.50000'), Decimal('16.10000'), Decimal('10.00000'), Decimal('6.90000'), Decimal('5.50000'), Decimal('113.80000')),
 (7, Decimal('-75.87860'), Decimal('82.81348'), Decimal('7.30000'), Decimal('4.60000'), Decimal('7.30000'), Decimal('5.30000'), Decimal('8.60000'), Decimal('8.10000'), Decimal('16.80000'), Decimal('20.70000'), Decimal('17.10000'), Decimal('10.10000'), Decimal('7.00000'), Decimal('6.00000'), Decimal('119.00000')),
 (8, Decimal('-72.28820'), Decimal('82.81348'), Decimal('7.70000'), Decimal('4.70000'), Decimal('7.70000'), Decimal('5.80000'), Decimal('9.10000'), Decimal('8.70000'), Decimal('17.70000'), Decimal('21.10000'), Decimal('18.50000'), Decimal('10.50000'), Decimal('7.10000'), Decimal('6.50000'), Decimal('125.10000'))]

----

## 1. What is the average altitude where vegetation type is "ice"?

## 2. What is the average altitude for each vegetation type?

## 3. What is the most frequent vegetation type by altitude?

## 4. Is there a correlation between altitude and precipitation?

(It's enough to show with a plot that a correlation exists or not.)